### Terraform``
#### Format Check 📏`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/morrislan/morrislan/runs/run-PWaBVVxGjUpmKfGk

Waiting for the plan to start...

Terraform v1.6.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudflare-zerotrust.cloudflare_access_identity_provider.github will be created
  + resource "cloudflare_access_identity_provider" "github" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + name       = "MorrisLAN GitHub"
      + type       = "github"

      + config {
          + attributes    = (known after apply)
          + claims        = (known after apply)
          + client_id     = (sensitive value)
          + client_secret = (sensitive value)
          + redirect_url  = (known after apply)
          + scopes        = (known after apply)
        }
    }

  # module.cloudflare-zerotrust.cloudflare_access_identity_provider.otp will be created
  + resource "cloudflare_access_identity_provider" "otp" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + name       = "OTP"
      + type       = "onetimepin"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_clancyadmin will be created
  + resource "cloudflare_record" "access_app_clancyadmin" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Clancy Admin"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "clancyadmin.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_ha will be created
  + resource "cloudflare_record" "access_app_ha" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Home Assistant"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ha.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_homeradmin will be created
  + resource "cloudflare_record" "access_app_homeradmin" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Homer Admin"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "homeradmin.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_status will be created
  + resource "cloudflare_record" "access_app_status" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Network Status page"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "status.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_unifi will be created
  + resource "cloudflare_record" "access_app_unifi" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for UniFi Controller"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "unifi.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel.clancy will be created
  + resource "cloudflare_tunnel" "clancy" {
      + account_id   = (sensitive value)
      + cname        = (known after apply)
      + config_src   = "cloudflare"
      + id           = (known after apply)
      + name         = "clancy.morrislan.net"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy will be created
  + resource "cloudflare_tunnel_config" "clancy" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = "status.morrislan.net"
              + service  = "http://marge.morrislan.net:3001"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "ha.morrislan.net"
              + service  = "https://ha.morrislan.net"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = false
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "unifi.morrislan.net"
              + service  = "https://marge.morrislan.net:8443"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "clancyadmin.morrislan.net"
              + service  = "https://clancy.morrislan.net:2053"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "homeradmin.morrislan.net"
              + service  = "https://homer.morrislan.net:2053"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

  # module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_application.application will be created
  + resource "cloudflare_access_application" "application" {
      + account_id                = (known after apply)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "clancyadmin.morrislan.net"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + logo_url                  = "https://user-images.githubusercontent.com/23664304/36225509-be167464-117f-11e8-9bfc-cba7acd889c5.png"
      + name                      = "Clancy Admin"
      + service_auth_401_redirect = false
      + session_duration          = "12h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_policy.github_policy will be created
  + resource "cloudflare_access_policy" "github_policy" {
      + account_id       = (known after apply)
      + application_id   = (known after apply)
      + decision         = "allow"
      + id               = (known after apply)
      + name             = "Clancy Admin GitHub Policy"
      + precedence       = 1
      + session_duration = "24h"
      + zone_id          = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = (known after apply)
              + name                 = "MorrisLAN"
              + teams                = [
                  + "Admins",
                ]
            }
        }
    }

  # module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application will be created
  + resource "cloudflare_access_application" "application" {
      + account_id                = (known after apply)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "ha.morrislan.net"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + logo_url                  = "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Home_Assistant_Logo.svg/2048px-Home_Assistant_Logo.svg.png"
      + name                      = "Home Assistant"
      + service_auth_401_redirect = false
      + session_duration          = "2160h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_policy.github_policy will be created
  + resource "cloudflare_access_policy" "github_policy" {
      + account_id       = (known after apply)
      + application_id   = (known after apply)
      + decision         = "allow"
      + id               = (known after apply)
      + name             = "Home Assistant GitHub Policy"
      + precedence       = 1
      + session_duration = "24h"
      + zone_id          = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = (known after apply)
              + name                 = "MorrisLAN"
              + teams                = []
            }
        }
    }

  # module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_application.application will be created
  + resource "cloudflare_access_application" "application" {
      + account_id                = (known after apply)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "homeradmin.morrislan.net"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + logo_url                  = "https://tweakers.net/ext/i/2005515460.png"
      + name                      = "Homer Admin"
      + service_auth_401_redirect = false
      + session_duration          = "12h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_policy.github_policy will be created
  + resource "cloudflare_access_policy" "github_policy" {
      + account_id       = (known after apply)
      + application_id   = (known after apply)
      + decision         = "allow"
      + id               = (known after apply)
      + name             = "Homer Admin GitHub Policy"
      + precedence       = 1
      + session_duration = "24h"
      + zone_id          = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = (known after apply)
              + name                 = "MorrisLAN"
              + teams                = [
                  + "Admins",
                ]
            }
        }
    }

  # module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application will be created
  + resource "cloudflare_access_application" "application" {
      + account_id                = (known after apply)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "status.morrislan.net"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + logo_url                  = "https://static-00.iconduck.com/assets.00/uptime-kuma-icon-512x469-ce3ut52z.png"
      + name                      = "Network Status"
      + service_auth_401_redirect = false
      + session_duration          = "12h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy will be created
  + resource "cloudflare_access_policy" "github_policy" {
      + account_id       = (known after apply)
      + application_id   = (known after apply)
      + decision         = "allow"
      + id               = (known after apply)
      + name             = "Network Status GitHub Policy"
      + precedence       = 1
      + session_duration = "24h"
      + zone_id          = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = (known after apply)
              + name                 = "MorrisLAN"
              + teams                = []
            }
        }
    }

  # module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application will be created
  + resource "cloudflare_access_application" "application" {
      + account_id                = (known after apply)
      + allowed_idps              = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "unifi.morrislan.net"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + logo_url                  = "https://assets-global.website-files.com/622b70d8906c7ab0c03f77f8/63b40a92093c6b2f3767e4e6_tMCv8T-y_400x400.png"
      + name                      = "UniFi"
      + service_auth_401_redirect = false
      + session_duration          = "12h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_policy.github_policy will be created
  + resource "cloudflare_access_policy" "github_policy" {
      + account_id       = (known after apply)
      + application_id   = (known after apply)
      + decision         = "allow"
      + id               = (known after apply)
      + name             = "UniFi GitHub Policy"
      + precedence       = 1
      + session_duration = "24h"
      + zone_id          = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = (known after apply)
              + name                 = "MorrisLAN"
              + teams                = [
                  + "Admins",
                ]
            }
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 19 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @m4xmorris, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*